/*
题目:
小明在X星球的城堡中发现了如下图形和文字：
rank=3
   * 
  * * 
 *   *  
* * * *


rank=5
               *                                                      
              * *                                                     
             *   *                                                    
            * * * *                                                   
           *       *                                                  
          * *     * *                                                 
         *   *   *   *                                                
        * * * * * * * *                                               
       *               *                                              
      * *             * *                                             
     *   *           *   *                                            
    * * * *         * * * *                                           
   *       *       *       *  
  * *     * *     * *     * *  
 *   *   *   *   *   *   *   * 
* * * * * * * * * * * * * * * *  


ran=6
                               *                                      
                              * *                                     
                             *   *                                    
                            * * * *                                   
                           *       *                                  
                          * *     * *                                 
                         *   *   *   *                                
                        * * * * * * * *                               
                       *               *                              
                      * *             * *                             
                     *   *           *   *                            
                    * * * *         * * * *                           
                   *       *       *       *                          
                  * *     * *     * *     * *                         
                 *   *   *   *   *   *   *   *                        
                * * * * * * * * * * * * * * * *                       
               *                               *                      
              * *                             * *                     
             *   *                           *   *                    
            * * * *                         * * * *                   
           *       *                       *       *                  
          * *     * *                     * *     * *                 
         *   *   *   *                   *   *   *   *                
        * * * * * * * *                 * * * * * * * *               
       *               *               *               *              
      * *             * *             * *             * *             
     *   *           *   *           *   *           *   *            
    * * * *         * * * *         * * * *         * * * *           
   *       *       *       *       *       *       *       *          
  * *     * *     * *     * *     * *     * *     * *     * *         
 *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *        
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *       

*/
/*
思路：
动态创建二维数组
从图中可找出规律
每次打印rank=n的图时
等价于打印三个rank=n-1的图
只是这三个图按照一定位置摆放
所以
利用二维数组实现快速摆放
摆放完后打印图片

*/
#include<stdio.h>
#include<stdlib.h>

int g(int n)//计算2的n次方
{
	int i,x=1;
	for(i=0;i<n;i++)
		x*=2;
	return x;
}

void h(int **p,int x,int y,int rank)
{
	if(rank==1)p[y][x]=1;
	else
	{
		h(p,x+(g(rank-1))/4,y,rank-1);//摆放第一个图
		h(p,x,y+g(rank-2),rank-1);//摆放第二个图
		h(p,x+(g(rank-1))/2,y+g(rank-2),rank-1);//摆放第三个图
	}
}
void f(int rank)
{
	int **p,i,j;
	p=(int **)malloc(sizeof(int*)*g(rank-1));//创建动态数组的列
	for(i=0;i<g(rank-1);i++)
		p[i]=(int*)malloc(sizeof(int)*(g(rank)-1));//创建动态数组的行
	for(i=0;i<g(rank-1);i++)
		for(j=0;j<g(rank)-1;j++)
			p[i][j]=0;
	h(p,0,0,rank);
	//打印图片
	for(i=0;i<g(rank-1);i++)
	{
		for(j=0;j<g(rank)-1;j++)
			if(p[i][j]==0)printf(" ");
			else printf("*");
		printf("\n");
	}
}
main()
{
	f(7);
	return;
}